import 'languages.dart';

class LanguageAr extends Languages {
  @override
  Map get setting => {
        'title': 'الاعدادات',
        'version': 'الاصدار',
        'about': 'عن التطبيق',
        'termsOfUse': 'سياسة الاستخدام',
        'shareApp': 'مشاركة التطبيق',
        'language': 'اللغة',
        'darkMode': 'الوضع الليلى',
        'contact': 'تواصل معنا',
    'privacy':'سياسة الخصوصية'
      };

  Map get home => {
        'notes': 'ملاحظات',
        'tasks': 'مـهــام',
        'memories': 'ذكريات ',
      };

  Map get search=>{
    'search':'بحث',
    'searchResult':'لا توجد نتائج ل ',
    'note':'ملاحظه',
    'task':'مهمه',
    'memory':'ذاكره',
  };

  Map get addNote => {
    'titleHint': 'العنوان...',
    'bodyHint': 'النـص...',
    'images': 'الــصــور',
    'records': 'التسجيلات',
  };
  Map get toast => {
    'delete': 'تم الحذف',
    'addToFav': 'ضيفت للمفضلة',
    'removeFav': 'حذفت من المفضلة',
    'saved': 'تم الحفظ',
  };

  Map get drawer=>{
    'notes':'ملاحظات',
    'tasks':'مهام',
    'memories':'ذكريات',
    'favorite':'المفضله',
    'secret':'سريه',
    'setting':'الاعدادات',
  };

  Map get secret =>{
    'createPass':'انشاء كلمة السر',
    'confirmPass':'تاكيد كلمة السر',
    'enterPass':'ادخل كلمة السر',
    'confirmError':'كلمة السر غي متطابقه, حاول مره اخري',
    'error':'كلمة السر غير صحيحه, حاول مره اخري ',
  'updatePass':'تغير كلمة السر',
  };
  Map get addTask =>{
    'title':'العنوان',
    'titleBody':'عنوان المهمه...',
    'titleError':'يجب ادخال العنوان',
    'date':'التاريخ',
    'dateError':'ادخل التاريخ',
    'time':'الوقت',
    'timeError':'ادخل الوقت',
    'addSubTask':'أضف مهمة فرعية',
    'bodySubTask':'اكتب مهمة فرعية',
    'bodySubTaskError':'يجب الا تكون فارغه',
  };
  Map get alertBottomSheetForAddItemInFavorite =>{
    'alertTitle':'الاضافه الى المفضله',
    'alertQuestion':'هل تريد اضافة هذا العنصر الي المفضله؟',
    'massage':'*اضافة هذا العنصر الى المفضله سيؤدي الى\nحذف هذا العنصر من السريه',
    'favoriteButton':'المفضله',
    'closeButton':'اغلاق',
  };


  Map get addMemory => {
    'titleHint': 'العنوان',
    'titleValidateText':'العنوان لا يمكن ان يكون فارغ',
    'detailsHint': 'تفاصيل الذكرى',
    'date':'التاريخ',
    'dateValidateText':'التاريخ مطلوب'
  };
  Map get discardAndSaveAlert => {
    'warning':'تحذير !!',
    'memoryEmpty':'عنوان او تاريخ الذكرى لا يمكن ان يكون فارغ',
    'memoryMessage': '- اذا ضغطت تجاهل لن يتم الحفظ و تخرج من الصفحة.\n- اذا ضغطت الغاء سوف تستكمل تعديل الذكرى.',
    'taskEmpty':'عنوان او تاريخ المهمه لا يمكن ان يكون فارغ',
    'taskMessage': '- اذا ضغطت تجاهل لن يتم الحفظ و تخرج من الصفحة.\n- اذا ضغطت الغاء سوف تستكمل تعديل المهمه.'
  };
  Map get onBoarding =>{
    'notes':'الملاحظات',
    'notesBody':'يمكنك كتابة ما تريد،و وضع الصور والتسجيلات لسماعها في اي وقت تريد.',
    'tasks':'المهام',
    'tasksBody':'أضف نشاطاتك بمثابة مهام لتحفيزك لإكمالها وتنظيم مهامك.',
    'memories':'الذكرايات',
    'memoriesBody':'ضع كل ذكرياتك هنا لتذكرها دائما كلما أردت!',
    'nextButton':'التالي',
    'startedButton':'بدأ الاستخدام'
  };


  Map get terms => {
    'title': 'سياسة الاستخدام',
  'termsBody':'هذه شروط الاستخدام تحكم استخدامك من ميجا مار، وأي معلومات أو نص أو رسومات أو صور أو مواد أخرى تظهر على تطبيق Nota، الرجوع إلى هذه الشروط. يجب عليك قراءة هذه الشروط وفهمها.',

    'privacy': 'الخصوصية',
    'privacyBody':   "يتم دمج سياسة خصوصية APP Nota في هذه الشروط. من خلال قبول هذه الشروط، فإنك توافق على الوصول إلى التخزين والميكروفون من خلال الخدمات وفقا لسياسة الخصوصية",
    'userContent': 'محتوى المستخدم',
    'userContentBody':
    "تتكون الخدمات من الميزات والمناطق التفاعلية التي تسمح للمستخدمين بإنشاء أو حذف أو تحديث، بما في ذلك على سبيل المثال لا الحصر على الصور أو الأصوات والنصوص أو العناصر أو المواد الأخرى (مجتمعة،). أنت تفهم أنك مسؤول عن جميع رسوم البيانات التي تكثفها باستخدام الخدمات. أنت تفهم أيضا أن محتوى المستخدم الخاص بك يمكن عرضه من قبل الآخرين ولديك فقط القدرة على التحكم في من يمكنه الوصول إلى هذا المحتوى عن طريق ضبط إعدادات الخصوصية الخاصة بك. وتوافق على الالتزام بمبادئ توجيهية مجتمعية، والتي قد يتم تحديثها من وقت الى وقت.",
    'feedback': 'استجابة',
    'feedbackBody': "أنت توافق على أن أي تعليقات أو اقتراحات أو أفكار أو مواد أخرى تتعلق بالثلوج أو الخدمات التي تقدمها، سواء عن طريق البريد الإلكتروني أو غير ذلك (ردود الفعل)، غير سرية وتصبح الملكية الوحيدة للثلوج. سيحققنا الحصول على الاستخدام غير المقيد ونشر هذه الملاحظات لأي غرض أو تجاري أو غير ذلك، دون الاعتراف أو تعويضك. أنت تتنازل عن أي حقوق قد تضطر إلى ردود الفعل (بما في ذلك أي حقوق نشر أو حقوق أخلاقية). نود الاستماع من المستخدمين، ولكن من فضلك لا تشارك أفكارك معنا إذا كنت تتوقع أن تدفع أو ترغب في مواصلة حقوق الملكية أو المطالبة معهم."
  };

  Map get appInfo=> {
  'title':'عن التطبيق',
  'onBoarding':'الصفحه الافتتاحية',
  'info':'عن التطبيق',
      'appInfoBody':' NOTA هو تطبيق مجاني يمكنك من كتابة ما تريد،و وضع الصور والتسجيلات لسماعها في اي وقت تريد, أضف نشاطاتك بمثابة مهام لتحفيزك لإكمالها وتنظيم مهامك, ضع كل ذكرياتك هنا لتذكرها دائما كلما أردت.'
      '\n\nيمكنك اضافة ملاحظاتك و مهامك و زكرياتك الخاصه في السريه لتكون الوحيد الذي يمكنه الوصول اليها من خلاص كلمة السر التي تنشأها'
      '\n\nيمكنك حفظ ملاحظاتك ومهامك وزكرياتك المفضله في صفحة المفضله للوصول اليه في اي وقت تريد'};
  String get cancelBtn =>'الغاء';
  String get discardBtn =>'تجاهل';
}
